In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
salary_1 =  pd.read_csv('/aiffel/data/salary_1.csv')
salary_2 =  pd.read_csv('/aiffel/data/salary_2.csv')

In [7]:
salary_df = pd.concat([salary_1, salary_2])

In [8]:
salary_df.isna().mean()

Age                    0.000598
Gender                 0.000000
Education Level        0.000000
Job Title              0.000000
Years of Experience    0.000000
Salary                 0.000000
Country                0.000000
Race                   0.000000
Senior                 0.000000
dtype: float64

In [9]:
salary_df = salary_df.dropna()

In [11]:
gender_salary = salary_df.groupby('Gender')['Salary'].mean()

In [12]:
gender_salary

Gender
Female    107888.555814
Male      121393.353134
Name: Salary, dtype: float64

In [14]:
gender_salary = gender_salary.reset_index()

In [15]:
gender_salary

   Gender         Salary
0  Female  107888.555814
1    Male  121393.353134

In [17]:
salary_df.head(3)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1

In [19]:
salary_df = salary_df.merge(gender_salary, on='Gender', how='left')

In [21]:
salary_df.head(3)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary_x,Country,Race,Senior,Salary_y
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0,121393.353134
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0,107888.555814
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1,121393.353134

In [24]:
salary_df = salary_df.rename({'Salary_x': 'Salary', 'Salary_y': 'Gender_salary'}, axis=1)

In [25]:
salary_df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior,Gender_salary
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0,121393.353134
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0,107888.555814
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1,121393.353134
3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0,107888.555814
4,52.0,Male,2,Director,20.0,200000,USA,Asian,0,121393.353134

In [28]:
pd.pivot_table(salary_df, index='Country', columns='Gender', values='Years of Experience')

Gender       Female      Male
Country
Australia  7.397227  8.493065
Canada     7.212199  8.878214
China      7.985618  8.444519
UK         7.575658  8.781466
USA        7.036526  8.475643

In [30]:
salary_df['Salary_log'] = np.log(salary_df['Salary'])

In [31]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6680 entries, 0 to 6679
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6680 non-null   float64
 1   Gender               6680 non-null   object
 2   Education Level      6680 non-null   int64
 3   Job Title            6680 non-null   object
 4   Years of Experience  6680 non-null   float64
 5   Salary               6680 non-null   int64
 6   Country              6680 non-null   object
 7   Race                 6680 non-null   object
 8   Senior               6680 non-null   int64
 9   Gender_salary        6680 non-null   float64
 10  Salary_log           6680 non-null   float64
dtypes: float64(4), int64(3), object(4)
memory usage: 884.3+ KB

In [33]:
salary_df.drop(['Gender','Job Title','Country','Race'], axis=1, inplace=True)

In [34]:
salary_df

,Age,Education Level,Years of Experience,Salary,Senior,Gender_salary,Salary_log
0,32.0,1,5.0,90000,0,121393.353134,11.407565
1,28.0,2,3.0,65000,0,107888.555814,11.082143
2,45.0,3,15.0,150000,1,121393.353134,11.918391
3,36.0,1,7.0,60000,0,107888.555814,11.002100
4,52.0,2,20.0,200000,0,121393.353134,12.206073
...,...,...,...,...,...,...,...
6675,49.0,3,20.0,200000,0,107888.555814,12.206073
6676,32.0,0,3.0,50000,0,121393.353134,10.819778
6677,30.0,1,4.0,55000,0,107888.555814,10.915088
6678,46.0,2,14.0,140000,0,121393.353134,11.849398
6679,26.0,0,1.0,35000,0,107888.555814,10.463103

In [35]:
from sklearn.preprocessing import RobustScaler

In [36]:
rs = RobustScaler()

In [37]:
rs.fit(salary_df)

RobustScaler()

In [38]:
rs_df = rs.transform(salary_df)

In [40]:
rs_df = pd.DataFrame(rs_df, columns=salary_df.columns)

In [41]:
rs_df

,Age,Education Level,Years of Experience,Salary,Senior,Gender_salary,Salary_log
0,0.0,0.0,-0.222222,-0.277778,0.0,0.0,-0.296515
1,-0.4,1.0,-0.444444,-0.555556,0.0,-1.0,-0.690165
2,1.3,2.0,0.888889,0.388889,1.0,0.0,0.321410
3,0.4,0.0,0.000000,-0.611111,0.0,-1.0,-0.786990
4,2.0,1.0,1.444444,0.944444,0.0,0.0,0.669408
...,...,...,...,...,...,...,...
6675,1.7,2.0,1.444444,0.944444,0.0,-1.0,0.669408
6676,0.0,-1.0,-0.444444,-0.722222,0.0,0.0,-1.007537
6677,-0.2,0.0,-0.333333,-0.666667,0.0,-1.0,-0.892244
6678,1.4,1.0,0.777778,0.277778,0.0,0.0,0.237953
6679,-0.6,-1.0,-0.666667,-0.888889,0.0,-1.0,-1.438992

In [42]:
from sklearn.preprocessing import MinMaxScaler

In [43]:
mm = MinMaxScaler()

In [45]:
mm_df = mm.fit_transform(salary_df)

In [47]:
mm_df = pd.DataFrame(mm_df, columns=salary_df.columns)

In [48]:
from sklearn.decomposition import PCA

In [49]:
pca = PCA(2)

In [50]:
pca_df = pca.fit_transform(salary_df)

In [54]:
pca_df = pd.DataFrame(pca_df, columns=['PC1', 'PC2'])

In [57]:
(pca.explained_variance_ratio_).sum()

0.9999999855512027